In [33]:
import pandas as pd
import numpy as np
import wrds

In [34]:
db = wrds.Connection()

Loading library list...
Done

In [37]:
#get table attributes for a sample day TAQ data
db.describe_table(library='taqmsec', table='ctm_20211231')

The row count will return 0 due to the structure of TAQ
There was a problem with retrievingthe row count: 'NoneType' object is not subscriptable
Approximately 0 rows in taqmsec.ctm_20211231.

           name  nullable                    type
0          date      True                    DATE
1        time_m      True  TIME WITHOUT TIME ZONE
2            ex      True              VARCHAR(1)
3      sym_root      True              VARCHAR(6)
4    sym_suffix      True             VARCHAR(10)
5      tr_scond      True              VARCHAR(4)
6          size      True                 NUMERIC
7         price      True                 NUMERIC
8   tr_stop_ind      True              VARCHAR(1)
9       tr_corr      True              VARCHAR(2)
10    tr_seqnum      True                 NUMERIC
11        tr_id      True             VARCHAR(20)
12    tr_source      True              VARCHAR(1)
13        tr_rf      True              VARCHAR(1)
14    part_time      True  TIME WITHOUT TIME ZONE
15     trf_time      True  TIME WITHOUT TIME ZONE
16      tte_ind      True              VARCHAR(1)

In [97]:
parm = {'tickers':('GOOG', 'GME', 'COUR', 'BK', 'NRG', 'LYB', 'UWMC', 'UNH', 'QSR', 'SPY'), 'frequency':'second'}

In [98]:
data = db.raw_sql("SELECT date, date_trunc(%(frequency)s, time_m)::time AS time, sym_root, SUM(size) AS size FROM taqmsec.ctm_20211231 WHERE sym_root in %(tickers)s GROUP BY symroot, date, time ORDER BY time", params=parm)

In [99]:
data.to_csv('2021-12-31_stock_data_sec.csv')